{"doc_id":"doc-1","tenant_id":"t1","source":"docs","title":"Docker daemon not running","body":"If you see: Cannot connect to the Docker daemon, it usually means Docker Desktop is not running. Start Docker Desktop, then retry docker compose up -d --build. On Linux, ensure the docker service is running and your user is in the docker group."}
{"doc_id":"doc-2","tenant_id":"t1","source":"docs","title":"chmod: Operation not permitted inside container","body":"Sometimes docker build fails with chmod: changing permissions of '/entrypoint.sh': Operation not permitted. A common fix is to set permissions at copy time using COPY --chmod=755 entrypoint.sh /entrypoint.sh (or COPY --chown=...). This avoids running chmod in a layer where the filesystem forbids it."}
{"doc_id":"doc-3","tenant_id":"t1","source":"docs","title":"Heredoc stuck (heredoc>) in zsh","body":"If your terminal shows heredoc> it means the shell is waiting for the terminator word. Press Ctrl+C to cancel, or type the terminator (for example JSON) on its own line to finish the heredoc."}
{"doc_id":"doc-4","tenant_id":"t1","source":"docs","title":"Vector DB debugging checklist","body":"To debug retrieval, log request_id, filters, embedding model and dimension, vector norm, ANN target hits, ranking profile, and returned doc ids. Always decide if the failure is recall (not retrieved) or ranking (retrieved but ordered wrong)."}
{"doc_id":"doc-5","tenant_id":"t2","source":"docs","title":"Tenant t2: Docker tips","body":"This document belongs to tenant t2. It mentions docker and daemon issues but should not appear when searching with tenant_id=t1."}
{"doc_id":"doc-6","tenant_id":"t1","source":"notes","title":"Cooking notes (noise)","body":"This is unrelated content about cooking pasta and sauces. It exists to make retrieval harder and to show that filters and ranking matter."}
{"doc_id":"doc-7","tenant_id":"t1","source":"docs","title":"## Compose errors\n## Missing contexts\n## Fixes","body":"## Missing build contexts\nIf docker compose says a build context path was not found, create the missing folder or fix the path in docker-compose.yml.\n\n## Services XML distribution-key\nIf Vespa says node missing required attribute distribution-key, add distribution-key=\"0\" to the node in services.xml.\n\n## HNSW schema syntax\nIf schema parsing fails around hnsw, ensure hnsw block is inside index { ... } and embedding field has indexing: attribute | index."}


